TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_dut/Core/Src/app_entry.c
static const osSemaphoreAttr_t BpkaSemaphore_attributes = {
  .name         = "BPKA Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

static osMutexId_t      crcCtrlMutex;
static uint32_t         crcLockCounter;

static const osMutexAttr_t crcCtrlMutex_attributes = {
  .name         = "CRC CTRL Mutex",
  .attr_bits    = osMutexRecursive,
  .cb_mem       = MUTEX_DEFAULT_CB_MEM,
  .cb_size      = MUTEX_DEFAULT_CB_SIZE,
};

static osMutexId_t      adcCtrlMutex;

static const osMutexAttr_t adcCtrlMutex_attributes = {
  .name         = "ADC CTRL Mutex",
  .attr_bits    = osMutexRecursive, /* The use of a recursive mutex allows to lock ADC for a series of individual measurements */
  .cb_mem       = MUTEX_DEFAULT_CB_MEM,
  .cb_size      = MUTEX_DEFAULT_CB_SIZE,
};

static osMutexId_t      advTraceMutex;

static const osMutexAttr_t advTraceMutex_attributes = {
  .name         = "Adv Trace Mutex",
  .attr_bits    = osMutexRecursive,
  .cb_mem       = MUTEX_DEFAULT_CB_MEM,
  .cb_size      = MUTEX_DEFAULT_CB_SIZE,
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private functions prototypes-----------------------------------------------*/

static void Config_HSE(void);
static void System_Init(void);
static void SystemPower_Config(const uint32_t initial_config);

static void RNG_Task_Entry(void * argument);
static void APPE_RNG_Init(void);

static void APPE_AMM_Init(void);
static void AMM_Task_Entry(void * argument);
static void AMM_WrapperInit(uint32_t * const p_PoolAddr, const uint32_t PoolSize);
static uint32_t * AMM_WrapperAllocate(const uint32_t BufferSize);
static void AMM_WrapperFree(uint32_t * const p_BufferAddr);

static void APPE_FLASH_MANAGER_Init(void);
static void FLASH_Manager_Task_Entry(void * argument);

static void APPE_BPKA_Init(void);
static void BPKA_Task_Entry(void * argument);

/* USER CODE BEGIN PFP */
#if (CFG_LED_SUPPORTED)
static void Led_Init(void);
#endif
#if ( CFG_LPM_LEVEL != 0)
static void TimerOSwakeupCB(void *arg);
#endif /* ( CFG_LPM_LEVEL != 0) */

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/

void MX_APPE_Config(void)
{
  /* Configure HSE Tuning */
  Config_HSE();
}

uint32_t MX_APPE_Init(void * p_param)
{
  APP_DEBUG_SIGNAL_SET(APP_APPE_INIT);

  UNUSED(p_param);

  /* System initialization */
  System_Init();

  /* Configure the system Power Mode */
  SystemPower_Config(TRUE);

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION)
  /* Initialize the Temperature measurement */
  TEMPMEAS_Init ();
#endif /* (USE_TEMPERATURE_BASED_RADIO_CALIBRATION) */

  /* Initialize the Advance Memory Manager module */
  APPE_AMM_Init();

  /* Initialize the Random Number Generator module */
  APPE_RNG_Init();

  /* Initialize the Flash Manager module */
  APPE_FLASH_MANAGER_Init();

  /* USER CODE BEGIN APPE_Init_1 */
#if (CFG_LED_SUPPORTED)
  Led_Init();
#endif

#if (CFG_SCM_SUPPORTED)
  /* Inform SCM that we want to run the App on PLL clock */
  scm_setsystemclock(SCM_USER_APP, SYS_PLL);
#endif /* CFG_SCM_SUPPORTED */
  /* USER CODE END APPE_Init_1 */

  /* Initialize the Ble Public Key Accelerator module */
  APPE_BPKA_Init();

  /* Initialize the Simple NVM Arbiter */
  SNVMA_Init ((uint32_t *)CFG_SNVMA_START_ADDRESS);

  /* USER CODE BEGIN APPE_Init_2 */
#ifdef STM32WBA5x
  /* Check MCU revision */
  const uint32_t mcu_rev_id = HAL_GetREVID();
#  ifdef STM32WBAXX_SI_CUT1_0
  if(mcu_rev_id != STM32WBAXX_SI_CUT1_0_DBGMCU_REVID_REG_VAL)
  {
    APP_DBG_MSG("Project is built for STM32WBA5x Rev.A, but detected revision is newer than Rev.A\n");
    Error_Handler();
  }
#  else
  if(mcu_rev_id == STM32WBAXX_SI_CUT1_0_DBGMCU_REVID_REG_VAL)
  {
    APP_DBG_MSG("Project is built for STM32WBA5x post Rev.A, but detected revision is Rev.A\n");
    Error_Handler();
  }
#  endif /* STM32WBAXX_SI_CUT1_0 */
#endif /* STM32WBA5x */

#if (CFG_LPM_LEVEL != 0)
  /* Create a SW timer to wakeup the system from low power state */
  UTIL_TIMER_Create(&TimerOSwakeup_Id,
                    0u, /* Timer period is set dynamically on activation */
                    UTIL_TIMER_ONESHOT,
                    &TimerOSwakeupCB, NULL);
#endif /* ( CFG_LPM_LEVEL != 0) */

  SID_APP_Init();

  /* Keep  RFTS Bypass (FD_FLASHACCESS_RFTS_BYPASS) enabled, it is managed by Sidewalk BLE driver */

  /* USER CODE END APPE_Init_2 */

  APP_DEBUG_SIGNAL_RESET(APP_APPE_INIT);

  return WPAN_SUCCESS;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

static void Config_HSE(void)
{
  OTP_Data_s* otp_ptr = NULL;

  /**
   * Read HSE_Tuning from OTP
   */
  if (OTP_Read(DEFAULT_OTP_IDX, &otp_ptr) != HAL_OK) {
    /* OTP no present in flash, apply default gain */
    HAL_RCCEx_HSESetTrimming(0x0C);
  }
  else
  {
    HAL_RCCEx_HSESetTrimming(otp_ptr->hsetune);
  }
}

/*----------------------------------------------------------------------------*/

static void System_Init( void )
{
  /* Clear RCC RESET flag */
  LL_RCC_ClearResetFlags();

  UTIL_TIMER_Init();

#if (CFG_LOG_SUPPORTED != 0)
  /* Initialize the logs ( using the USART ) */
  Log_Module_Init( Log_Module_Config );

  /* Process any errors that triggered a reset */
  Fatal_Error_Report_Handler();
#endif  /* (CFG_LOG_SUPPORTED != 0) */

#ifdef BLE
  ll_sys_platform_init();
#endif /* BLE */

  adcCtrlMutex = osMutexNew(&adcCtrlMutex_attributes);
  if (NULL == adcCtrlMutex)
  {
    /* Can't proceed without mutex for ADC access management */
    Error_Handler();
  }
  ADCCTRL_Init();

  crcCtrlMutex = osMutexNew(&crcCtrlMutex_attributes);
  if (NULL == crcCtrlMutex)
  {
    /* Can't proceed without mutex for CRC access management */
    Error_Handler();
  }
  crcLockCounter = 0u;
  CRCCTRL_Init();

#if(CFG_RT_DEBUG_DTB)
  /* DTB initialization and configuration */
  RT_DEBUG_DTBInit();
  RT_DEBUG_DTBConfig();
#endif /* CFG_RT_DEBUG_DTB */
#if(CFG_RT_DEBUG_GPIO_MODULE)
  /* RT DEBUG GPIO_Init */
  RT_DEBUG_GPIO_Init();
#endif /* (CFG_RT_DEBUG_GPIO_MODULE) */

#if (CFG_DEBUGGER_LEVEL > 1)
  if ((CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) != 0u)
  {
    /* Keep debug facilities up & running in Stop and Standby modes if a debugger is attached at startup */
    LL_DBGMCU_EnableDBGStopMode();
    LL_DBGMCU_EnableDBGStandbyMode();
  }
  else
#endif /* CFG_DEBUGGER_LEVEL */
  {
    /* Disable debug facilities in Stop and Standby modes to allow more accurate power consumption measurements in LPM */
    LL_DBGMCU_DisableDBGStopMode();
    LL_DBGMCU_DisableDBGStandbyMode();
  }

  return;
}

