TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_dut/Core/Src/app_entry.c
/*----------------------------------------------------------------------------*/

/**
 * @brief  Configure the system for power optimization
 *
 * @note  This API configures the system to be ready for low power mode
 *
 * @param  None
 * @retval None
 */
static void SystemPower_Config(const uint32_t initial_config)
{
  if (initial_config != FALSE)
  {
#if (CFG_SCM_SUPPORTED)
    /* Initialize System Clock Manager */
    scm_init();
#endif /* CFG_SCM_SUPPORTED */

#if (CFG_LPM_LEVEL != 0)
    /* Initialize low power manager */
    UTIL_LPM_Init();
    /* Disable Stand-by mode by default */
    UTIL_LPM_SetOffMode((1 << CFG_LPM_APP), UTIL_LPM_DISABLE);
#endif /* (CFG_LPM_LEVEL != 0)  */
  }

  LL_PWR_EnableUltraLowPowerMode();
  __HAL_FLASH_SLEEP_POWERDOWN_ENABLE();
}

/*----------------------------------------------------------------------------*/

static void RNG_Task_Entry(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    int hw_rng_status;

    osSemaphoreAcquire(RngSemaphore, osWaitForever);
    hw_rng_status = HW_RNG_Process();
    if (HW_OK == hw_rng_status)
    {
      osSemaphoreRelease(RngPoolSemaphore);
    }
  }
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Initialize Random Number Generator module
 */
static void APPE_RNG_Init(void)
{
  HW_RNG_SetPoolThreshold(CFG_HW_RNG_POOL_THRESHOLD);
  HW_RNG_Init();
  HW_RNG_Start();

  /* Create Random Number Generator RTOS objects */

  RngSemaphore = osSemaphoreNew(1U, 0U, &RngSemaphore_attributes);

  RngPoolSemaphore = osSemaphoreNew(1U, 1U, &RngPoolSemaphore_attributes);

  RngTaskHandle = osThreadNew(RNG_Task_Entry, NULL, &RngTask_attributes);

  if ((RngTaskHandle == NULL) || (RngSemaphore == NULL) || (RngPoolSemaphore == NULL))
  {
    LOG_ERROR_APP("RNG RTOS objects creation FAILED");
    Error_Handler();
  }
}

/*----------------------------------------------------------------------------*/

static void APPE_AMM_Init(void)
{
  /* Initialize the Advance Memory Manager */
  if( AMM_Init(&ammInitConfig) != AMM_ERROR_OK )
  {
    Error_Handler();
  }

  /* Create Advance Memory Manager RTOS objects */

  AmmSemaphore = osSemaphoreNew(1U, 0U, &AmmSemaphore_attributes);

  AmmTaskHandle = osThreadNew(AMM_Task_Entry, NULL, &AmmTask_attributes);

  if ((AmmTaskHandle == NULL) || (AmmSemaphore == NULL))
  {
    LOG_ERROR_APP("AMM RTOS objects creation FAILED");
    Error_Handler();
  }
}

/*----------------------------------------------------------------------------*/

static void AMM_Task_Entry(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osSemaphoreAcquire(AmmSemaphore, osWaitForever);
    AMM_BackgroundProcess();
  }
}

/*----------------------------------------------------------------------------*/

static void AMM_WrapperInit(uint32_t * const p_PoolAddr, const uint32_t PoolSize)
{
  UTIL_MM_Init ((uint8_t *)p_PoolAddr, ((size_t)PoolSize * sizeof(uint32_t)));
}

/*----------------------------------------------------------------------------*/

static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize)
{
  return (uint32_t *)UTIL_MM_GetBuffer(((size_t)BufferSize * sizeof(uint32_t)));
}

/*----------------------------------------------------------------------------*/

static void AMM_WrapperFree (uint32_t * const p_BufferAddr)
{
  UTIL_MM_ReleaseBuffer((void *)p_BufferAddr);
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Initialize Flash Manager module
 */
static void APPE_FLASH_MANAGER_Init(void)
{
  /* Create Flash Manager RTOS objects */

  FlashManagerSemaphore = osSemaphoreNew(1U, 0U, &FlashManagerSemaphore_attributes);

  FlashManagerTaskHandle = osThreadNew(FLASH_Manager_Task_Entry, NULL, &FlashManagerTask_attributes);

  if ((FlashManagerTaskHandle == NULL) || (FlashManagerSemaphore == NULL))
  {
    LOG_ERROR_APP("FLASH RTOS objects creation FAILED");
    Error_Handler();
  }

  /* Enable and set FLASH Interrupt priority */
  /* FLASH interrupt is used to handle ECC corrections */
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ECCC);
  __HAL_FLASH_ENABLE_IT(FLASH_IT_ECCC);
  HAL_NVIC_SetPriority(FLASH_IRQn, FLASH_INTR_PRIO, 0u);
  HAL_NVIC_EnableIRQ(FLASH_IRQn);

  /* Disable flash before any use - RFTS */
  FD_SetStatus (FD_FLASHACCESS_RFTS, LL_FLASH_DISABLE);
  /* Enable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_ENABLE);
  /* Enable flash system flag */
  FD_SetStatus (FD_FLASHACCESS_SYSTEM, LL_FLASH_ENABLE);

  return;
}

/*----------------------------------------------------------------------------*/

static void FLASH_Manager_Task_Entry(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osSemaphoreAcquire(FlashManagerSemaphore, osWaitForever);
    FM_BackgroundProcess();
  }
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Initialize Ble Public Key Accelerator module
 */
static void APPE_BPKA_Init(void)
{
  /* Create Ble Public Key Accelerator RTOS objects */

  BpkaSemaphore = osSemaphoreNew(1U, 0U, &BpkaSemaphore_attributes);

  BpkaTaskHandle = osThreadNew(BPKA_Task_Entry, NULL, &BpkaTask_attributes);

  if ((BpkaTaskHandle == NULL) || (BpkaSemaphore == NULL))
  {
    LOG_ERROR_APP("BPKA RTOS objects creation FAILED");
    Error_Handler();
  }

}

/*----------------------------------------------------------------------------*/

static void BPKA_Task_Entry(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osSemaphoreAcquire(BpkaSemaphore, osWaitForever);
    BPKA_BG_Process();
  }
}

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0)
/* OS wakeup callback */
static void TimerOSwakeupCB(void *arg)
{
  /* USER CODE BEGIN TimerOSwakeupCB */
  (void)arg;
  /* USER CODE END TimerOSwakeupCB */
  return;
}
#endif /* (CFG_LPM_LEVEL != 0) */

/*----------------------------------------------------------------------------*/

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
#if (CFG_LED_SUPPORTED)
static void Led_Init(void)
{
  /* Leds Initialization */
#if defined(NUCLEO_WBA65_BOARD)
  BSP_LED_Init(LED_BLUE);
#endif /* NUCLEO_WBA65_BOARD */
#if defined(NUCLEO_WBA52_BOARD) || defined(NUCLEO_WBA55_BOARD) || defined(NUCLEO_WBA65_BOARD)
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);

