TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_dut/Core/Src/app_entry.c
  BSP_LED_On(LED_GREEN);
#else
#warning "Unknown board, usable LEDs are not defined"
#endif /* NUCLEO_WBA52_BOARD || NUCLEO_WBA55_BOARD || NUCLEO_WBA65_BOARD */

  return;
}
#endif /* CFG_LED_SUPPORTED */

/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void BPKACB_Process(void)
{
  osSemaphoreRelease(BpkaSemaphore);
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Callback used by Random Number Generator to launch Task to generate Random Numbers
 */
void HWCB_RNG_Process( void )
{
  osSemaphoreRelease(RngSemaphore);
}

/*----------------------------------------------------------------------------*/

void AMM_RegisterBasicMemoryManager(AMM_BasicMemoryManagerFunctions_t * const p_BasicMemoryManagerFunctions)
{
  /* Fulfill the function handle */
  p_BasicMemoryManagerFunctions->Init = AMM_WrapperInit;
  p_BasicMemoryManagerFunctions->Allocate = AMM_WrapperAllocate;
  p_BasicMemoryManagerFunctions->Free = AMM_WrapperFree;
}

/*----------------------------------------------------------------------------*/

void AMM_ProcessRequest(void)
{
  /* Trigger to call Advance Memory Manager process function */
  osSemaphoreRelease(AmmSemaphore);
}

/*----------------------------------------------------------------------------*/

void FM_ProcessRequest(void)
{
  /* Trigger to call Flash Manager process function */
  osSemaphoreRelease(FlashManagerSemaphore);
}

/*----------------------------------------------------------------------------*/

#if (CFG_LOG_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED void UTIL_ADV_TRACE_PreSendHook(void)
{
  /* USER CODE BEGIN UTIL_ADV_TRACE_PreSendHook_0 */

  /* USER CODE END UTIL_ADV_TRACE_PreSendHook_0 */
#if (CFG_LPM_LEVEL != 0)
  UTIL_LPM_SetStopMode((1 << CFG_LPM_LOG), UTIL_LPM_DISABLE);
#endif /* (CFG_LPM_LEVEL != 0) */
  /* USER CODE BEGIN UTIL_ADV_TRACE_PreSendHook_1 */

  /* USER CODE END UTIL_ADV_TRACE_PreSendHook_1 */
}
#endif /* (CFG_LOG_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LOG_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED void UTIL_ADV_TRACE_PostSendHook(void)
{
  /* USER CODE BEGIN UTIL_ADV_TRACE_PostSendHook_0 */

  /* USER CODE END UTIL_ADV_TRACE_PostSendHook_0 */
#if (CFG_LPM_LEVEL != 0)
  UTIL_LPM_SetStopMode((1 << CFG_LPM_LOG), UTIL_LPM_ENABLE);
#endif /* (CFG_LPM_LEVEL != 0) */
  /* USER CODE BEGIN UTIL_ADV_TRACE_PostSendHook_1 */

  /* USER CODE END UTIL_ADV_TRACE_PostSendHook_1 */
}
#endif /* (CFG_LOG_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if ((CFG_LOG_SUPPORTED == 0) && (CFG_LPM_LEVEL != 0) && (CFG_SCM_SUPPORTED == 0))
/* RNG module turn off HSI clock when traces are not used and low power used */
SID_STM32_SPEED_OPTIMIZED void RNG_KERNEL_CLK_OFF(void)
{
  /* USER CODE BEGIN RNG_KERNEL_CLK_OFF_1 */

  /* USER CODE END RNG_KERNEL_CLK_OFF_1 */
  LL_RCC_HSI_Disable();
  /* USER CODE BEGIN RNG_KERNEL_CLK_OFF_2 */

  /* USER CODE END RNG_KERNEL_CLK_OFF_2 */
}
#endif /* ((CFG_LOG_SUPPORTED == 0) && (CFG_LPM_LEVEL != 0)  && (CFG_SCM_SUPPORTED == 0)) */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void HW_RNG_WaitPoolIsFull(void)
{
  /* USER CODE BEGIN HW_RNG_WaitPoolIsFull_0 */

  /* USER CODE END HW_RNG_WaitPoolIsFull_0 */
  (void)osSemaphoreAcquire(RngPoolSemaphore, osWaitForever);
  /* USER CODE BEGIN HW_RNG_WaitPoolIsFull_1 */

  /* USER CODE END HW_RNG_WaitPoolIsFull_1 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED CRCCTRL_Cmd_Status_t CRCCTRL_MutexTake(void)
{
  osStatus_t os_status;
  CRCCTRL_Cmd_Status_t crc_status;
  /* USER CODE BEGIN CRCCTRL_MutexTake_0 */

  /* USER CODE END CRCCTRL_MutexTake_0 */
  os_status = osMutexAcquire(crcCtrlMutex, osWaitForever);
  if (osOK == os_status)
  {
    if (0u == crcLockCounter)
    {
      /* Enable CRC clock if this is the initial lock request. No actions required for any further recursive locks */
      __HAL_RCC_CRC_CLK_ENABLE();
    }
    crcLockCounter++;

    crc_status = CRCCTRL_OK;
  }
  else
  {
    crc_status = CRCCTRL_NOK;
  }
  /* USER CODE BEGIN CRCCTRL_MutexTake_1 */

  /* USER CODE END CRCCTRL_MutexTake_1 */
  return crc_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED CRCCTRL_Cmd_Status_t CRCCTRL_MutexRelease(void)
{
  osStatus_t os_status;
  CRCCTRL_Cmd_Status_t crc_status;
  /* USER CODE BEGIN CRCCTRL_MutexRelease_0 */

  /* USER CODE END CRCCTRL_MutexRelease_0 */
  os_status = osMutexRelease(crcCtrlMutex);
  if (osOK == os_status)
  {
    if (crcLockCounter > 0u)
    {
      crcLockCounter--;
    }

    if (0u == crcLockCounter)
    {
      /* Disable CRC clock to save power after the last recursive lock is released */
      __HAL_RCC_CRC_CLK_DISABLE();
    }

    crc_status = CRCCTRL_OK;
  }
  else
  {
    crc_status = CRCCTRL_NOK;
  }
  /* USER CODE BEGIN CRCCTRL_MutexRelease_1 */

  /* USER CODE END CRCCTRL_MutexRelease_1 */
  return crc_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED ADCCTRL_Cmd_Status_t ADCCTRL_MutexTake(void)
{
  osStatus_t os_status;
  ADCCTRL_Cmd_Status_t adc_status;
  /* USER CODE BEGIN ADCCTRL_MutexTake_0 */

  /* USER CODE END ADCCTRL_MutexTake_0 */
  os_status = osMutexAcquire(adcCtrlMutex, osWaitForever);
  adc_status = (osOK == os_status) ? ADCCTRL_OK : ADCCTRL_NOK;
  /* USER CODE BEGIN ADCCTRL_MutexTake_1 */

  /* USER CODE END ADCCTRL_MutexTake_1 */
  return adc_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED ADCCTRL_Cmd_Status_t ADCCTRL_MutexRelease(void)
{
  osStatus_t os_status;
  ADCCTRL_Cmd_Status_t adc_status;
  /* USER CODE BEGIN ADCCTRL_MutexRelease_0 */

  /* USER CODE END ADCCTRL_MutexRelease_0 */
  os_status = osMutexRelease(adcCtrlMutex);
  adc_status = (osOK == os_status) ? ADCCTRL_OK : ADCCTRL_NOK;
  /* USER CODE BEGIN ADCCTRL_MutexRelease_1 */

