TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_dut/Core/Src/app_entry.c
  /* USER CODE END ADCCTRL_MutexRelease_1 */
  return adc_status;
}

/*----------------------------------------------------------------------------*/

void UTIL_ADV_TRACE_CriticalSectionInit(void)
{
  /* USER CODE BEGIN UTIL_ADV_TRACE_CriticalSectionInit_0 */

  /* USER CODE END UTIL_ADV_TRACE_CriticalSectionInit_0 */
  if (NULL == advTraceMutex)
  {
    advTraceMutex = osMutexNew(&advTraceMutex_attributes);
    if (NULL == advTraceMutex)
    {
      /* Can't proceed without mutex for ADV_TRACE access management */
      Error_Handler();
    }
  }
  /* USER CODE BEGIN UTIL_ADV_TRACE_CriticalSectionInit_1 */

  /* USER CODE END UTIL_ADV_TRACE_CriticalSectionInit_1 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t UTIL_ADV_TRACE_EnterCriticalSection(void)
{
  osStatus_t os_status;
  uint32_t mutex_acquired;

  /* USER CODE BEGIN UTIL_ADV_TRACE_EnterCriticalSection_0 */

  /* USER CODE END UTIL_ADV_TRACE_EnterCriticalSection_0 */
  os_status = osMutexAcquire(advTraceMutex, osWaitForever);
  if (osOK == os_status)
  {
    /* Disable just the IRQs associated with the logging. Do it in a critical section to ensure coherency of UART and DMA IRQ states */
    sid_pal_enter_critical_region();
    HAL_NVIC_DisableIRQ(LOG_UART_HANDLER_IRQn);
    HAL_NVIC_DisableIRQ(LOG_UART_HANDLER_TX_DMA_IRQn);
    sid_pal_exit_critical_region();
    mutex_acquired = TRUE;
  }
  else
  {
    /* Unable to use the mutex, fall back to a critical section to avoid race conditions on accessing the log buffer */
    sid_pal_enter_critical_region();
    mutex_acquired = FALSE;
  }
  /* USER CODE BEGIN UTIL_ADV_TRACE_EnterCriticalSection_1 */

  /* USER CODE END UTIL_ADV_TRACE_EnterCriticalSection_1 */

  return mutex_acquired;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void UTIL_ADV_TRACE_ExitCriticalSection(const uint32_t mutex_used)
{
  /* USER CODE BEGIN UTIL_ADV_TRACE_ExitCriticalSection_0 */

  /* USER CODE END UTIL_ADV_TRACE_ExitCriticalSection_0 */
  if (mutex_used != FALSE)
  {
    sid_pal_enter_critical_region();
    HAL_NVIC_EnableIRQ(LOG_UART_HANDLER_TX_DMA_IRQn);
    HAL_NVIC_EnableIRQ(LOG_UART_HANDLER_IRQn);
    sid_pal_exit_critical_region();

    (void)osMutexRelease(advTraceMutex);
  }
  else
  {
    sid_pal_exit_critical_region();
  }
  /* USER CODE BEGIN UTIL_ADV_TRACE_ExitCriticalSection_1 */

  /* USER CODE END UTIL_ADV_TRACE_ExitCriticalSection_1 */
}

/* USER CODE END FD_WRAP_FUNCTIONS */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0)
SID_STM32_SPEED_OPTIMIZED void MX_APPE_EnterLPM(const uint64_t expectedSleepDurationUs)
{
  UTIL_LPM_LegacyMode_t target_lpm_mode = (UTIL_LPM_LegacyMode_t)UTIL_LPM_GetMaxMode();

  if (APPE_OS_SLEEP_NO_WAKEUP == expectedSleepDurationUs)
  {
    /* It is not necessary to configure an interrupt to bring the
      microcontroller out of its low power state at a fixed time in the
      future. */
  }
  else
  {
    /* Configure an interrupt to bring the microcontroller out of its low
       power state at the time the kernel next needs to execute. The
       interrupt must be generated from a source that remains operational
       when the microcontroller is in a low power state. */
    uint64_t wakeupAheadTimeUs;

    if ((target_lpm_mode != UTIL_LPM_OFFMODE) && (target_lpm_mode != UTIL_LPM_STOPMODE) && (target_lpm_mode != UTIL_LPM_SLEEPMODE))
    {
      /* Normally this shall never happen */
      assert_param(0);
    }

    /* Check if Standby LPM is a viable option */
    if (UTIL_LPM_OFFMODE == target_lpm_mode)
    {
      wakeupAheadTimeUs = CFG_LPM_STDBY_WAKEUP_TIME;
      if ((expectedSleepDurationUs <= wakeupAheadTimeUs) || ((expectedSleepDurationUs - wakeupAheadTimeUs) < (CFG_LPM_STDBY_MIN_DURATION_MS * 1000u)))
      {
        /* Expected idle time is too short to enter Standby mode. Downgrade the target LPM to Stop mode */
        UTIL_LPM_SetMaxMode(1u << CFG_LPM_SYS, UTIL_LPM_STOPMODE);
        target_lpm_mode = UTIL_LPM_STOPMODE;
      }
    }

    /* Check for Stop mode applicability */
    if (UTIL_LPM_STOPMODE == target_lpm_mode)
    {
      wakeupAheadTimeUs = CFG_LPM_STOP_WAKEUP_DELAY_US;
      if ((expectedSleepDurationUs <= wakeupAheadTimeUs) || ((expectedSleepDurationUs - wakeupAheadTimeUs) < (CFG_LPM_STOP_MIN_DURATION_US)))
      {
        /* Expected idle time is too short to enter Stop mode. Downgrade the target LPM to Sleep mode */
        UTIL_LPM_SetMaxMode(1u << CFG_LPM_SYS, UTIL_LPM_SLEEPMODE);
        target_lpm_mode = UTIL_LPM_SLEEPMODE;
      }
    }

    /* Configure wakeup ahead time for Sleep LPM */
    if (UTIL_LPM_SLEEPMODE == target_lpm_mode)
    {
      wakeupAheadTimeUs = CFG_LPM_SLEEP_WAKEUP_DELAY_US;
    }

    /* Compute the idle duration accounting for wakeup ahead time */
    const uint64_t actualSleepDurationUs = (expectedSleepDurationUs > wakeupAheadTimeUs) ? (expectedSleepDurationUs - wakeupAheadTimeUs) : expectedSleepDurationUs;

    /* Schedule wakeup timer IRQ */
    const UTIL_TIMER_Status_t timerStatus = UTIL_TIMER_StartWithPeriodUs(&TimerOSwakeup_Id, actualSleepDurationUs);
    (void)timerStatus;
    assert_param(UTIL_TIMER_OK == timerStatus);
  }

  LL_PWR_ClearFlag_STOP(); /* Standby, Stop 1, and Stop 2 share the same flag, so this single call is sufficient */
  LL_PWR_ClearFlag_WU(); /* Clear all related wakeup flags */

  if ((UTIL_LPM_OFFMODE == target_lpm_mode) && (ll_sys_is_initialized() != FALSE))
  {
    APP_SYS_BLE_EnterDeepSleep();
  }

  LL_RCC_ClearResetFlags();

#  if defined(STM32WBA5x) && defined(STM32WBAXX_SI_CUT1_0)
  /* Wait until HSE is ready */
  while (LL_RCC_HSE_IsReady() == 0);

  UTILS_ENTER_LIMITED_CRITICAL_SECTION(RCC_INTR_PRIO << 4U);
  // FIXME: SCM may not be in use, scm_hserdy_isr may be empty
  scm_hserdy_isr();
  UTILS_EXIT_LIMITED_CRITICAL_SECTION();
#  endif /* STM32WBA5x && STM32WBAXX_SI_CUT1_0 */

  UTIL_LPM_EnterLowPower(); /* WFI instruction call is inside this API */
}
#endif /* (CFG_LPM_LEVEL != 0) */

