TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_dut/Core/Src/app_entry.c
/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0)
SID_STM32_SPEED_OPTIMIZED void MX_APPE_LeaveLPM(void)
{
  (void)UTIL_TIMER_Stop(&TimerOSwakeup_Id);

  /* Put the radio in active state */
  if (ll_sys_is_initialized() != FALSE)
  {
    LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_RADIO);
    ll_sys_dp_slp_exit();
    UTIL_LPM_SetOffMode(1U << CFG_LPM_LL_DEEPSLEEP, UTIL_LPM_ENABLE);
  }

  /* Reset system LPM selection limitation */
  UTIL_LPM_SetMaxMode(1u << CFG_LPM_SYS, UTIL_LPM_OFFMODE);
}
#endif /* (CFG_LPM_LEVEL != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0)
SID_STM32_SPEED_OPTIMIZED uint64_t MX_APPE_GetSystemIdleTime(void)
{
  uint64_t systemIdleTimeUs;
  uint32_t nextRtcEventTicks;
  uint64_t nextRtcEventUs;
  uint64_t nextBleEventUs;

  /* Get remaining time till the nearest RTC event */
  nextRtcEventTicks = UTIL_TIMER_GetFirstRemainingTime();
  nextRtcEventUs = (APPE_RTC_TICKS_NO_WAKEUP == nextRtcEventTicks) ? APPE_OS_SLEEP_NO_WAKEUP : TIMER_IF_Convert_Tick2us(nextRtcEventTicks);

  /* Get remaining time till the nearest 2.4GHz radio event */
  if (ll_sys_is_initialized() != FALSE)
  {
    ble_stat_t cmd_status;
    uint32_t   next_event_tmp;

    cmd_status = ll_intf_le_get_remaining_time_for_next_event(&next_event_tmp);
    UNUSED(cmd_status);
    assert_param(cmd_status == SUCCESS);

    nextBleEventUs = (LL_DP_SLP_NO_WAKEUP == next_event_tmp) ? APPE_OS_SLEEP_NO_WAKEUP : (uint64_t)next_event_tmp;
  }
  else
  {
    nextBleEventUs = APPE_OS_SLEEP_NO_WAKEUP;
  }

  systemIdleTimeUs = MIN(nextRtcEventUs, nextBleEventUs);

  return systemIdleTimeUs;
}
#endif /* (CFG_LPM_LEVEL != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED void MX_APPE_StandbyExit(void)
{
  /* Restore system power optimizations */
  SystemPower_Config(FALSE);

  /* Restore flash IRQ for ECC events handling */
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ECCC);
  __HAL_FLASH_ENABLE_IT(FLASH_IT_ECCC);
  HAL_NVIC_SetPriority(FLASH_IRQn, FLASH_INTR_PRIO, 0u);
  HAL_NVIC_EnableIRQ(FLASH_IRQn);

  /* Enable NVIC for Wkup pins */
  HAL_NVIC_SetPriority(WKUP_IRQn, 5u, 0u);
  HAL_NVIC_EnableIRQ(WKUP_IRQn);

  /* App-specific exit actions */
  SID_APP_StandbyExit();
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */
